snlkuharlocal/src/InformationRegisters/ОчередьЗадач/ОчередьЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЗадач</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадания</name>
    <type>
      <types>EnumRef.СостоянияФЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>пОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееФЗ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска_План</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска_Факт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.ПроцессыОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксЧислоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопытки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаОбработки</name>
    <type>
      <types>CatalogRef.ЗадачиОбработкиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЗадачиВладельца</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибкаВыполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Задачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЧасти</name>
    <comment>map_index</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ЗадачиОтложеннойОбработкиДокументов/ЗадачиОтложеннойОбработкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиОтложеннойОбработкиДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧастей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбработаноЧастей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ошибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Задачи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПланНабора</types>
      <types>DocumentRef.ХранилищеКодовМаркировки</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>EnumRef.ЗадачиОтложеннойОбработкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостоянияФЗ/СостоянияФЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияФЗ</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
    <comment>scheduled</comment>
  </enumValues>
  <enumValues>
    <name>ВОчереди</name>
    <comment>queued</comment>
  </enumValues>
  <enumValues>
    <name>Активно</name>
    <comment>running</comment>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
    <comment>success</comment>
  </enumValues>
  <enumValues>
    <name>ЗавершеноАварийно</name>
    <comment>failed</comment>
  </enumValues>
  <enumValues>
    <name>ВедущееЗавершеноАварийно</name>
    <comment>upstream_failed</comment>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
    <comment>skipped</comment>
  </enumValues>
  <enumValues>
    <name>Отсрочено</name>
    <comment>deferred</comment>
  </enumValues>
  <enumValues>
    <name>КПовтору</name>
    <comment>up for retry</comment>
  </enumValues>
  <enumValues>
    <name>КПовторномуПланированию</name>
    <comment>up for reschedule</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/InformationRegisters/ОчередьЗадач/ManagerModule.bsl
Функция СоздатьЗадачу(ИмяМетода, ИмяОчереди, Основание = Неопределено, пОбработки = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запускать	= Ложь;
	НомерЧасти	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "НомерЧасти", 0);
	
	//+++Чирков 30.05.2026 MARK-3589
	//рПоиска = НайтиЗадачу(ИмяМетода, Основание);
	рПоиска = НайтиЗадачу(ИмяМетода, Основание, НомерЧасти);
	//---Чирков 30.05.2026 
	Если рПоиска.Успешно Тогда
		Повторно	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Повторно", Ложь);
		Если Повторно Тогда
			Запускать = Истина;				
		Иначе
			Данные = рПоиска.Данные;
			Если ЗначениеЗаполнено(Данные.СостояниеЗадания) Тогда
				ТекСтатус = ""+Данные.СостояниеЗадания+".";
			Иначе
				ТекСтатус = "Ожидание запуска.";
			КонецЕсли;			
			
			ТекстСообщения = СтрШаблон(
				"Задача '%1' для объекта '%2' уже запланирована. 
				|Плановая дата выполнения: %3, факт. дата выполнения:  %4. Текущий статус: %5. Выполнено успешно: %6. Ошибки: %7.",
				Данные.ИмяМетода, Данные.Основание, Данные.ДатаЗапуска_План, Данные.ДатаЗапуска_Факт, ТекСтатус , Данные.Успешно, Данные.Ошибки
			);
			
			Результат.Ошибки.Добавить(ТекстСообщения);						
		КонецЕсли;
	Иначе	
		Запускать = Истина;	
	КонецЕсли; 	
	
	Если Запускать Тогда
		Запись = РегистрыСведений.ОчередьЗадач.СоздатьМенеджерЗаписи();
		
		Запись.ИД_Задачи 	= Новый УникальныйИдентификатор;		
		Запись.НомерЧасти	= НомерЧасти;
		
		Запись.ИмяОчереди	= ИмяОчереди;
		Запись.ИмяМетода 	= ИмяМетода;				
		Запись.Приоритет	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "Приоритет", 10);	
		Запись.Основание	= Основание;
		
		Запись.Автор 		= ПараметрыСеанса.Пользователь;
		Запись.ДатаЗапуска_План = ТекущаяДата();
		//+++Чирков 01.06.2026 - ИД основной задачи - используется при разбивке задач на куски
		//для совместимости в первой записи совпадает ИД_Задачи и ИД_ЗадачиВладельца 
		ИД_ЗадачиВладельца	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ИД_ЗадачиВладельца");
		Запись.ИД_ЗадачиВладельца	= ?(ИД_ЗадачиВладельца = Неопределено, Запись.ИД_Задачи, ИД_ЗадачиВладельца);
		Запись.ЗадачаОбработки 		= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ЗадачаОбработки");
		Запись.КоличествоОбъектов	= МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "КоличествоОбъектов");
		//---Чирков 01.06.2026
		
		Если ЗначениеЗаполнено(пОбработки) Тогда
			Запись.пОбработки 	= Новый ХранилищеЗначения(пОбработки, Новый СжатиеДанных(9));
		КонецЕсли;
		
		Запись.Записать();		
		
		Результат.Успешно	= Истина;
		Результат.Данные	= Запись.ИД_Задачи;
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //СоздатьЗадачу(ИмяОчереди, ИмяМетода, Основание = Неопределено, пОбработки = Неопределено) Экспорт

//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
//Функция ЗапуститьЗадачу(ИД_Задачи) Экспорт
Функция ЗапуститьЗадачу(ИД_Задачи, НомерЧасти = 0) Экспорт
//---Чирков 26.01.2026
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Если ЗначениеЗаполнено(ИД_Задачи) Тогда
		Запись = РегистрыСведений.ОчередьЗадач.СоздатьМенеджерЗаписи();
		Запись.ИД_Задачи	= ИД_Задачи;
		//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
		Запись.НомерЧасти   = НомерЧасти;
		//---Чирков 26.01.2026
		
		Запись.Прочитать();
		
		Если ЗначениеЗаполнено(Запись.ИД_Задачи) Тогда
			Если ЗначениеЗаполнено(Запись.СостояниеЗадания) Тогда
				ТекстСообщения = СтрШаблон("Недопустимое состояние задачи: '%1' !", Запись.СостояниеЗадания);
				Результат.Ошибки.Добавить(ТекстСообщения);
			Иначе
				пОбработки = Запись.пОбработки.Получить();
				
				пМетодаС = МаркировкаКС.ПолучитьЗначениеПараметра(пОбработки, "ПараметрыМетода", Новый Структура);
				
				пМетода = Новый Массив;
				Для Каждого КиЗ Из пМетодаС Цикл
					пМетода.Добавить(КиЗ.Значение);				
				КонецЦикла;				
				
				пВызова = Новый Массив;
				пВызова.Добавить(Запись.ИмяМетода);
				пВызова.Добавить(пМетода);				
				
				Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
				
				//+++Чирков 02.06.2026
				КлючФЗ = СтрШаблон("%1_%2", Запись.ИД_Задачи, Запись.НомерЧасти);
				//ФЗ = ФоновыеЗадания.Выполнить("инт_ДлительныеОперации.ВызватьФункциюКонфигурации", пВызова, Запись.ИД_Задачи, Запись.ИмяОчереди + "." + Запись.ИмяМетода);
				ФЗ = ФоновыеЗадания.Выполнить("инт_ДлительныеОперации.ВызватьФункциюКонфигурации", пВызова, КлючФЗ, Запись.ИмяОчереди + "." + Запись.ИмяМетода);
				//---Чирков
				
				Запись.ДатаЗапуска_Факт	= ТекущаяДата();
				Запись.ИсполняющееФЗ 	= ФЗ.УникальныйИдентификатор;
				Запись.СостояниеЗадания = РегистрыСведений.ОчередьЗадач.ЗначениеСостояния(ФЗ.Состояние);
				Запись.Записать();
				
				ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
				ЗаписатьВЛог("Отладка.ОчередьЗадач", "Время записи запуска задачи: " + ВремяВыполнения, "Информация");
				
				Результат.Успешно = Истина;
				
				ТекстСообщения = СтрШаблон(
					"Запущено выполнение задачи: %1, очередь: %2. Время запуска: %3.",
					Запись.ИмяМетода, Запись.ИмяОчереди, Запись.ДатаЗапуска_Факт
				);
				Результат.Сообщения.Добавить(ТекстСообщения);
			КонецЕсли; 		
		Иначе
			ТекстСообщения = СтрШаблон("Задача '%1' не найдена в очереди !", ИД_Задачи);
			Результат.Ошибки.Добавить(ТекстСообщения);
		КонецЕсли; 
	Иначе   
		Результат.Ошибки.Добавить("Не указан ИД задачи !");
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
//Функция НайтиЗадачу(ИмяМетода, Основание)
Функция НайтиЗадачу(ИмяМетода, Основание, НомерЧасти = 0)
//---Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	*	
	|ИЗ
	|   РегистрСведений.ОчередьЗадач
	|ГДЕ
	|	ИмяМетода 	= &ИмяМетода
	|	И Основание = &Основание          
	|	И НомерЧасти = &НомерЧасти
	|	И (
	|		СостояниеЗадания = ЗНАЧЕНИЕ(Перечисление.СостоянияФЗ.ПустаяСсылка)
	|		ИЛИ СостояниеЗадания = ЗНАЧЕНИЕ(Перечисление.СостоянияФЗ.Активно)
	|	)	
	|";	
		
	Запрос.УстановитьПараметр("ИмяМетода", 	ИмяМетода);
	Запрос.УстановитьПараметр("Основание",	Основание);
	Запрос.УстановитьПараметр("НомерЧасти", НомерЧасти);
	
	мЗадачи = Запрос.Выполнить().Выгрузить(); 
	Если мЗадачи.Количество() > 0 Тогда
		Задача = мЗадачи[0];
		Результат.Успешно = Истина;
		Результат.Данные = Новый Структура;
		Для Каждого Кол Из мЗадачи.Колонки Цикл
			Результат.Данные.Вставить(Кол.Имя, Задача[Кол.Имя]);
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //НайтиЗадачу(ИмяМетода, Основание, НомерЧасти = 0)
 
Функция ОбновитьСостояниеИсполняющегоФЗ(ФЗ, рВыполнения = Неопределено) Экспорт
	рПоиска = НайтиЗадачуПоФЗ(ФЗ);
	
	Если рПоиска.Успешно Тогда
		ИД_Задачи	= рПоиска.Данные.ИД_Задачи;
		
		Запись = РегистрыСведений.ОчередьЗадач.СоздатьМенеджерЗаписи();
		Запись.ИД_Задачи	= ИД_Задачи;          
		//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
		Запись.НомерЧасти   = рПоиска.Данные.НомерЧасти;                    ;                           
		//---Чирков 26.01.2026
		Запись.Прочитать();
		Если Запись.ИД_Задачи = ИД_Задачи Тогда						
			Если рВыполнения = Неопределено Тогда       
				Запись.СостояниеЗадания = ЗначениеСостояния(ФЗ.Состояние);
			Иначе
				Запись.СостояниеЗадания = Перечисления.СостоянияФЗ.Завершено;
				
				Запись.Успешно 			= рВыполнения.Успешно; 				
				Запись.ВремяВыполнения  = рВыполнения.ВремяВыполнения;
				
				Если рВыполнения.Успешно Тогда
				Иначе
					Запись.Ошибки = СтрСоединить(рВыполнения.Ошибки, Символы.ПС);					
					//+++Чирков 05.06.2026 для отслеживания необходимости перезапуска задачи
					Запись.ОшибкаВыполнения = МаркировкаКС.ПолучитьЗначениеПараметра(рВыполнения, "ОшибкаВыполнения", Ложь);					
				КонецЕсли;
				Если ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно
					ИЛИ ФЗ.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
					Запись.ОшибкаВыполнения = Истина;									
				КонецЕсли;
				//---Чирков 05.06.2026
				
				//++Данилова Е.В. 28.04.2025 MARK-1675
				Запись.ДатаЗавершения = ТекущаяДата();
				//--Данилова Е.В. 28.04.2025 
			КонецЕсли; 
			
			Если ФЗ.Состояние <> СостояниеФоновогоЗадания.Активно И НЕ ЗначениеЗаполнено(Запись.ДатаЗавершения) Тогда
				Запись.ДатаЗавершения = ТекущаяДата();			
			КонецЕсли;
			
			Запись.Записать();
		КонецЕсли;		
	КонецЕсли;
КонецФункции //ОбновитьСостояниеИсполняющегоФЗ(ФЗ, рВыполнения = Неопределено) Экспорт

Функция НайтиЗадачуПоФЗ(ФЗ) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата(Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИД_Задачи,
	//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
	|	НомерЧасти,
	//---Чирков 26.01.2026 Проверки ЧЗ
	|	СостояниеЗадания
	|ИЗ
	|	РегистрСведений.ОчередьЗадач
	|ГДЕ
	|	ИсполняющееФЗ = &ИсполняющееФЗ
	|";
	
	Запрос.УстановитьПараметр("ИсполняющееФЗ", ФЗ.УникальныйИдентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ИД_Задачи) Тогда
		//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
		//Результат.Данные = Новый Структура("ИД_Задачи,СостояниеЗадания");
		Результат.Данные = Новый Структура("ИД_Задачи,СостояниеЗадания,НомерЧасти");
		//---Чирков 26.01.2026
		
		ЗаполнитьЗначенияСвойств(Результат.Данные, Выборка);             
		
		Результат.Успешно = Истина;
	Иначе
		ЗаписатьВЛог("Отладка.ОчередьЗадач", "Не найдена задача по ФЗ: " + ФЗ.УникальныйИдентификатор, "Ошибка");
	КонецЕсли;	                                            
	
	Возврат Результат;
КонецФункции //НайтиЗадачуПоФЗ(ФЗ) Экспорт

Функция ЗначениеСостояния(СостояниеФЗ) Экспорт
	Результат = Перечисления.СостоянияФЗ.ПустаяСсылка();
	
	Если СостояниеФЗ = СостояниеФоновогоЗадания.Активно Тогда
		Результат = Перечисления.СостоянияФЗ.Активно;
	ИначеЕсли СостояниеФЗ = СостояниеФоновогоЗадания.Завершено Тогда
		Результат = Перечисления.СостоянияФЗ.Завершено;
	ИначеЕсли СостояниеФЗ = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат = Перечисления.СостоянияФЗ.ЗавершеноАварийно;
	ИначеЕсли СостояниеФЗ = СостояниеФоновогоЗадания.Отменено Тогда
		Результат = Перечисления.СостоянияФЗ.Отменено;			
	КонецЕсли;               
	Возврат Результат;
КонецФункции //ЗначеиеСостояния(СостояниеФЗ) Экспорт

Функция ОбслужитьОчереди(АдресРезультата = Неопределено) Экспорт	
	РегистрыСведений.ЗадачиОтложеннойОбработкиДокументов.ЗапланироватьВыполнениеЗадач();
	
	рОбслуживания = ОбновитьСтатусыЗадач();
	АктивныеЗадачи = рОбслуживания.Данные;
	рЗапуска = ЗапуститьЗадачи(АктивныеЗадачи);
	
	МаркировкаКС.ДобавитьСообщения(рОбслуживания, рЗапуска);
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(рОбслуживания, АдресРезультата);	
	КонецЕсли;
	
	Возврат рОбслуживания;
КонецФункции //ОбслужитьОчереди()

Функция ЗапуститьЗадачи(АктивныеЗадачи)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИмяОчереди,
	|	ИД_Задачи,
	//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
	|	НомерЧасти                                              
	//---Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
	|ИЗ
	|	РегистрСведений.ОчередьЗадач КАК ОчередьЗадач
	|ГДЕ
	|	ДатаЗапуска_План <= &ДатаЗапуска_План
	|	И СостояниеЗадания = ЗНАЧЕНИЕ(Перечисление.СостоянияФЗ.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ИмяОчереди,
	|	Приоритет,
	//++Данилова Е.В. 22.01.2026 MARK-3443 
	|	ДатаЗапуска_План  
	//--Данилова Е.В. 22.01.2026 
	|ИТОГИ ПО
	|	ИмяОчереди
	|";	
	
	Запрос.УстановитьПараметр("ДатаЗапуска_План", ТекущаяДата());	
	
	Выборка_ИмяОчереди = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ИмяОчереди");
	Пока Выборка_ИмяОчереди.Следующий() Цикл
		ИмяОчереди = Выборка_ИмяОчереди.ИмяОчереди;
		
		Выполняется = МаркировкаКС.ПолучитьЗначениеПараметра(АктивныеЗадачи, ИмяОчереди, 0);
		Запущено	= 0;
		МаксКол		= МаксКоличествоАктивныхЗадач(ИмяОчереди);
		Выборка = Выборка_ИмяОчереди.Выбрать();
		Пока Выборка.Следующий() И Выполняется < МаксКол Цикл		
			//+++Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
			//ЗапуститьЗадачу(Выборка.ИД_Задачи);     
			ЗапуститьЗадачу(Выборка.ИД_Задачи, Выборка.НомерЧасти);
			//---Чирков 26.01.2026 Проверки ЧЗ - разбивка задач на части
			
			Выполняется = Выполняется + 1;
			Запущено	= Запущено + 1;
		КонецЦикла;
		
		ТекстСообщения = СтрШаблон("Запущено %1 задач из очереди: %2.", Запущено, ИмяОчереди);
		Результат.Сообщения.Добавить("");
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции //ЗапуститьЗадачи(АктивныеЗадачи)

Функция МаксКоличествоАктивныхЗадач(ИмяОчереди) 
	//Данилова Е.В. 22.01.2026 MARK-3443
	Результат = 10;
	//Результат = 5; 
	////++Данилова Е.В. 29.04.2025 MARK-1675
	////Если ИмяОчереди = "ЗагрузкаКМ" Тогда
	////	Результат = 2;
	////КонецЕсли;
	//Если СтрНайти(ИмяОчереди, "ЗагрузкаКМ") > 0 Тогда
	//	Результат = 2;
	////Данилова Е.В. 23.06.2025 MARK-1675
	////ИначеЕсли СтрНайти(ИмяОчереди,"ОтправкаВСУЗЗаказКМ") > 0 Тогда  //Данилова Е.В. 26.05.2025
	////	Результат = 1; 
	//Иначе 
	//	Результат = 10; 
	//КонецЕсли;

	//--Данилова Е.В. 29.04.2025
	Возврат Результат;
КонецФункции //МаксКоличествоАктивныхЗадач(ИмяОчереди)

Функция ОбновитьСтатусыЗадач() Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	АктивныеЗадачи = Новый Соответствие;
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ 
	|	ИмяОчереди,
	|	ИД_Задачи,
	|	СостояниеЗадания,
	|	ИсполняющееФЗ
	|ИЗ
	|	РегистрСведений.ОчередьЗадач
	|ГДЕ
	|	СостояниеЗадания = ЗНАЧЕНИЕ(Перечисление.СостоянияФЗ.Активно)	
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗапуска_Факт УБЫВ
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	ВремяВыполнения = (ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало)/1000;
	//+++Чирков 30.05.2026 без задачи
	//ЗаписатьВЛог("Отладка", "Очередь задач. Время получения активных задач: " + ВремяВыполнения, "Информация");
	//---Чирков 30.05.2026
	
	Пока Выборка.Следующий() Цикл
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИсполняющееФЗ);
		Если ФЗ <> Неопределено Тогда
			Если ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда			
				Количество = АктивныеЗадачи[Выборка.ИмяОчереди];
				Если Количество = Неопределено Тогда
					Количество = 0;				
				КонецЕсли;
				АктивныеЗадачи[Выборка.ИмяОчереди] = Количество + 1;           
			//+++Чирков 03.07.2025 - временно до выяснения проблем с сзапись статусов задач	
			ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				ОбновитьСостояниеИсполняющегоФЗ(ФЗ, Результат);
				
				ТекстСообщения = СтрШаблон("Обновление статуса по завершенной задаче: %1, очередь: %2, ФЗ: %3.", 
					Выборка.ИД_Задачи, Выборка.ИмяОчереди, Выборка.ИсполняющееФЗ
				);
				ЗаписатьВЛог("Отладка.ОчередьЗадач", ТекстСообщения, "Информация");
			//---Чирков 03.07.2025
			ИначеЕсли ФЗ.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				Результат = МаркировкаКС.СтруктураРезультата(Ложь);
				
				Инфо		= ФЗ.ИнформацияОбОшибке;
				ТекстОшибки = СтрШаблон("%1 %2 %3 %4", Инфо.Описание, Инфо.ИмяМодуля, Инфо.НомерСтроки, Инфо.ИсходнаяСтрока);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
				ОбновитьСостояниеИсполняющегоФЗ(ФЗ, Результат);
			КонецЕсли;
			
			Результат.ОбработаноОбъектов = Результат.ОбработаноОбъектов + 1;
		КонецЕсли;		
	КонецЦикла;
	
	Результат.Сообщения.Добавить("Активных задач: " + Выборка.Количество());
	
	Результат.Данные = АктивныеЗадачи;
	
	Возврат Результат;
КонецФункции //ОбновитьСтатусыЗадач()

Функция ПерезапуститьУпавшиеЗадачи(пОбработки = Неопределено) Экспорт
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИД_Задачи,
	|	НомерЧасти,
	|	ЗадачаОбработки.ИнтервалПовтораЗадач 	КАК ИнтервалПовтораЗадач,
	|	ЗадачаОбработки.ИнтервалМеждуЗадачами	КАК ИнтервалМеждуЗадачами
	|ИЗ
	|	РегистрСведений.ОчередьЗадач КАК ОчередьЗадач
	|ГДЕ
	|	НЕ Успешно
	|	И ДатаЗавершения >= &ДатаЗавершения
	|	И ДатаЗавершения < ДОБАВИТЬКДАТЕ(&ТекущаяДата, СЕКУНДА, -ЗадачаОбработки.ИнтервалПовтораЗадач)
	|	И НомерПопытки < IsNull(ЗадачаОбработки.МаксЧислоПопыток, 0)
	|ИТОГИ ПО
	|	ЗадачаОбработки
	|";
	
	Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДата()); //За последние сутки	
	Запрос.УстановитьПараметр("ДатаЗавершения", ТекущаяДата() - 24*60*60); //За последние сутки	
	
	ОбработаноОбъектов = 0;
	
	Выборка_ЗадачаОбработки	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗадачаОбработки");
	Пока Выборка_ЗадачаОбработки.Следующий() Цикл
		ДатаЗапуска = ТекущаяДата();	
		ИнтервалМеждуЗадачами = Выборка_ЗадачаОбработки.ИнтервалМеждуЗадачами;
		
		Выборка 	= Выборка_ЗадачаОбработки.Выбрать();		
		Пока Выборка.Следующий() Цикл
			ДатаЗапуска = ДатаЗапуска + ИнтервалМеждуЗадачами;
			ПерезапуститьЗадачу(Выборка.ИД_Задачи, Выборка.НомерЧасти, ДатаЗапуска);		
			ОбработаноОбъектов = ОбработаноОбъектов + 1;
		КонецЦикла;		
	КонецЦикла;	
	
	Результат.ОбработаноОбъектов = ОбработаноОбъектов;
	
	Возврат Результат;
КонецФункции //ПерезапуститьУпавшиеЗадачи(пОбработки = Неопределено) Экспорт

Функция ПерезапуститьЗадачу(ИД_Задачи, НомерЧасти, ДатаЗапуска)
	Запись = РегистрыСведений.ОчередьЗадач.СоздатьМенеджерЗаписи();
	Запись.ИД_Задачи = ИД_Задачи; 
	Запись.НомерЧасти= НомерЧасти;
	
	Запись.Прочитать();		
	
	Запись.ДатаЗапуска_План = ДатаЗапуска;
	Запись.ДатаЗапуска_Факт	= Неопределено;
	Запись.ДатаЗавершения	= Неопределено;
	Запись.НомерПопытки		= Запись.НомерПопытки + 1;
	Запись.СостояниеЗадания = Неопределено;                                                
	Запись.Ошибки			= "";
	Запись.ВремяВыполнения	= 0;
	Запись.КоличествоОбъектов = 0;
	
	Запись.Записать();	
КонецФункции //ПерезапуститьЗадачу(ИД_Задачи, НомерЧасти, ИнтервалПовтораЗадач)

//+++Чирков 05.06.2026
Функция ОчиститьОчередь(ИД_Задачи) Экспорт
	НЗ = РегистрыСведений.ОчередьЗадач.СоздатьНаборЗаписей();
	НЗ.Отбор.ИД_Задачи.Установить(ИД_Задачи, Истина);
	НЗ.Записать();
КонецФункции //ОчиститьОчередь(ИД_Задачи) Экспорт
//---Чирков 05.06.2026
